Jmeter Happy test.jmx
<?xml version="1.0" encoding="UTF-8"?>
<jmeterTestPlan version="1.2" properties="5.0" jmeter="5.6.3">
  <hashTree>
    <TestPlan guiclass="TestPlanGui" testclass="TestPlan" testname="Test Plan">
      <elementProp name="TestPlan.user_defined_variables" elementType="Arguments" guiclass="ArgumentsPanel" testclass="Arguments" testname="User Defined Variables">
        <collectionProp name="Arguments.arguments"/>
      </elementProp>
      <boolProp name="TestPlan.functional_mode">false</boolProp>
      <boolProp name="TestPlan.serialize_threadgroups">false</boolProp>
    </TestPlan>
    <hashTree>
      <ThreadGroup guiclass="ThreadGroupGui" testclass="ThreadGroup" testname="Thread Group - Tenant 1 (SEPA)">
        <stringProp name="TestPlan.comments">Duplicate and adjust settings to create multiple threads</stringProp>
        <intProp name="ThreadGroup.num_threads">10</intProp>
        <intProp name="ThreadGroup.ramp_time">1</intProp>
        <boolProp name="ThreadGroup.same_user_on_next_iteration">true</boolProp>
        <stringProp name="ThreadGroup.on_sample_error">continue</stringProp>
        <elementProp name="ThreadGroup.main_controller" elementType="LoopController" guiclass="LoopControlPanel" testclass="LoopController" testname="Loop Controller">
          <stringProp name="LoopController.loops">10</stringProp>
          <boolProp name="LoopController.continue_forever">false</boolProp>
        </elementProp>
      </ThreadGroup>
      <hashTree>
        <HeaderManager guiclass="HeaderPanel" testclass="HeaderManager" testname="HTTP Header Manager">
          <collectionProp name="HeaderManager.headers"/>
        </HeaderManager>
        <hashTree/>
        <CSVDataSet guiclass="TestBeanGUI" testclass="CSVDataSet" testname="Payment templates &amp; settings">
          <stringProp name="delimiter">,</stringProp>
          <stringProp name="fileEncoding">UTF-8</stringProp>
          <stringProp name="filename">/home/rnsxpc/Documents/Projects/HappyJMeter/HappyJmeterTest_SEPA.csv</stringProp>
          <boolProp name="ignoreFirstLine">true</boolProp>
          <boolProp name="quotedData">false</boolProp>
          <boolProp name="recycle">true</boolProp>
          <stringProp name="shareMode">shareMode.thread</stringProp>
          <boolProp name="stopThread">false</boolProp>
          <stringProp name="TestPlan.comments">Test run configuration file with following schema - [RawMessageNoHit, RawMessageHit, Instance, MessageType, Direction, HitProportion]</stringProp>
        </CSVDataSet>
        <hashTree/>
        <JSR223PreProcessor guiclass="TestBeanGUI" testclass="JSR223PreProcessor" testname="JSR223 PreProcessor - random hit/no hit message picker">
          <stringProp name="scriptLanguage">groovy</stringProp>
          <stringProp name="cacheKey">true</stringProp>
          <stringProp name="script">import java.util.concurrent.ThreadLocalRandom

/*
Expected JMeter vars from CSV Data Set Config:
- RawMessageNoHit
- RawMessageHit
- HitProportion

Outputs:
- selectedPayload
- selectedPayloadType   = HIT / NO_HIT
- hitSelected           = true / false
*/

// Parse HitProportion robustly:
// - if 0..1 =&gt; probability directly
// - if 1..100 =&gt; treated as percentage
double parseProbability(String raw) {
    if (raw == null || raw.trim().isEmpty()) {
        return 0.0d
    }

    double v = raw.trim().toDouble()

    if (v &gt; 1.0d) {
        v = v / 100.0d
    }

    if (v &lt; 0.0d) v = 0.0d
    if (v &gt; 1.0d) v = 1.0d

    return v
}

String rawMessageNoHit = vars.get(&quot;RawMessageNoHit&quot;)
String rawMessageHit   = vars.get(&quot;RawMessageHit&quot;)
double hitProbability  = parseProbability(vars.get(&quot;HitProportion&quot;))

boolean useHit = ThreadLocalRandom.current().nextDouble() &lt; hitProbability
String selectedPayload = useHit ? rawMessageHit : rawMessageNoHit

vars.put(&quot;selectedPayload&quot;, selectedPayload ?: &quot;&quot;)
vars.put(&quot;selectedPayloadType&quot;, useHit ? &quot;HIT&quot; : &quot;NO_HIT&quot;)
vars.put(&quot;hitSelected&quot;, String.valueOf(useHit))

// Optional: useful metadata passthrough
vars.put(&quot;selectedInstance&quot;, vars.get(&quot;Instance&quot;) ?: &quot;&quot;)
vars.put(&quot;selectedMessageType&quot;, vars.get(&quot;MessageType&quot;) ?: &quot;&quot;)
vars.put(&quot;selectedDirection&quot;, vars.get(&quot;Direction&quot;) ?: &quot;&quot;)

log.debug(&quot;Payload selected: ${vars.get(&apos;selectedPayloadType&apos;)}, HitProportion=${hitProbability}&quot;)</stringProp>
          <stringProp name="TestPlan.comments">Selects messages given the HitProportion per parameter</stringProp>
        </JSR223PreProcessor>
        <hashTree/>
        <JSR223PreProcessor guiclass="TestBeanGUI" testclass="JSR223PreProcessor" testname="JSR223 PreProcessor - build request payload and put into variable (required for AWS signature)">
          <stringProp name="scriptLanguage">groovy</stringProp>
          <stringProp name="cacheKey">true</stringProp>
          <stringProp name="script">// Build XML body
def body = &quot;&quot;&quot;
&lt;?xml version=&quot;1.0&quot; encoding=&quot;UTF-8&quot;?&gt;
&lt;Request&gt;
    ${selectedPayload}|${selectedInstance}|${selectedPayloadType}|${selectedDirection}|${selectedMessageType}|${System}
&lt;/Request&gt;
&quot;&quot;&quot;

// Store into JMeter variable
vars.put(&quot;request_body&quot;, body)</stringProp>
        </JSR223PreProcessor>
        <hashTree/>
        <Arguments guiclass="ArgumentsPanel" testclass="Arguments" testname="Header configuration">
          <collectionProp name="Arguments.arguments">
            <elementProp name="aws_access_key" elementType="Argument">
              <stringProp name="Argument.name">aws_access_key</stringProp>
              <stringProp name="Argument.value">my_key</stringProp>
              <stringProp name="Argument.metadata">=</stringProp>
            </elementProp>
            <elementProp name="aws_secret_key" elementType="Argument">
              <stringProp name="Argument.name">aws_secret_key</stringProp>
              <stringProp name="Argument.value">my_secret</stringProp>
              <stringProp name="Argument.metadata">=</stringProp>
            </elementProp>
            <elementProp name="aws_region" elementType="Argument">
              <stringProp name="Argument.name">aws_region</stringProp>
              <stringProp name="Argument.value">eu-central-1</stringProp>
              <stringProp name="Argument.metadata">=</stringProp>
            </elementProp>
            <elementProp name="aws_service" elementType="Argument">
              <stringProp name="Argument.name">aws_service</stringProp>
              <stringProp name="Argument.value">my_service_name</stringProp>
              <stringProp name="Argument.metadata">=</stringProp>
            </elementProp>
            <elementProp name="aws_method" elementType="Argument">
              <stringProp name="Argument.name">aws_method</stringProp>
              <stringProp name="Argument.value">POST</stringProp>
              <stringProp name="Argument.metadata">=</stringProp>
            </elementProp>
            <elementProp name="aws_endpoint" elementType="Argument">
              <stringProp name="Argument.name">aws_endpoint</stringProp>
              <stringProp name="Argument.value">http://localhost:3000/</stringProp>
              <stringProp name="Argument.metadata">=</stringProp>
            </elementProp>
            <elementProp name="content_type" elementType="Argument">
              <stringProp name="Argument.name">content_type</stringProp>
              <stringProp name="Argument.value">application/soap+xml</stringProp>
              <stringProp name="Argument.metadata">=</stringProp>
            </elementProp>
            <elementProp name="soap_action" elementType="Argument">
              <stringProp name="Argument.name">soap_action</stringProp>
              <stringProp name="Argument.value">my_soap_action</stringProp>
              <stringProp name="Argument.metadata">=</stringProp>
            </elementProp>
          </collectionProp>
        </Arguments>
        <hashTree/>
        <JSR223PreProcessor guiclass="TestBeanGUI" testclass="JSR223PreProcessor" testname="JSR223 PreProcessor (AWS Signature)">
          <stringProp name="scriptLanguage">groovy</stringProp>
          <stringProp name="cacheKey">true</stringProp>
          <stringProp name="script">import java.nio.charset.StandardCharsets
import java.security.MessageDigest
import javax.crypto.Mac
import javax.crypto.spec.SecretKeySpec
import java.time.ZonedDateTime
import java.time.ZoneOffset
import java.time.format.DateTimeFormatter
import java.net.URI
import java.net.URLEncoder
import org.apache.jmeter.protocol.http.control.Header
import org.apache.jmeter.protocol.http.control.HeaderManager

String sha256Hex(String data) {
    MessageDigest md = MessageDigest.getInstance(&quot;SHA-256&quot;)
    byte[] digest = md.digest(data.getBytes(StandardCharsets.UTF_8))
    return digest.collect { String.format(&quot;%02x&quot;, it) }.join()
}

byte[] hmacSha256(byte[] key, String data) {
    Mac mac = Mac.getInstance(&quot;HmacSHA256&quot;)
    mac.init(new SecretKeySpec(key, &quot;HmacSHA256&quot;))
    return mac.doFinal(data.getBytes(StandardCharsets.UTF_8))
}

String bytesToHex(byte[] bytes) {
    bytes.collect { String.format(&quot;%02x&quot;, it) }.join()
}

String awsEncode(String value, boolean path) {
    String encoded = URLEncoder.encode(value, &quot;UTF-8&quot;)
            .replace(&quot;+&quot;, &quot;%20&quot;)
            .replace(&quot;*&quot;, &quot;%2A&quot;)
            .replace(&quot;%7E&quot;, &quot;~&quot;)
    if (path) {
        encoded = encoded.replace(&quot;%2F&quot;, &quot;/&quot;)
    }
    return encoded
}

String canonicalUri(String rawPath) {
    if (rawPath == null || rawPath.isEmpty()) {
        return &quot;/&quot;
    }
    return rawPath.split(&quot;/&quot;, -1)
            .collect { awsEncode(it, false) }
            .join(&quot;/&quot;)
            .with { it.startsWith(&quot;/&quot;) ? it : &quot;/&quot; + it }
}

String canonicalQueryString(String rawQuery) {
    if (rawQuery == null || rawQuery.trim().isEmpty()) {
        return &quot;&quot;
    }

    List&lt;Map&gt; pairs = []
    rawQuery.split(&quot;&amp;&quot;).each { part -&gt;
        int idx = part.indexOf(&quot;=&quot;)
        String key = idx &gt;= 0 ? part.substring(0, idx) : part
        String value = idx &gt;= 0 ? part.substring(idx + 1) : &quot;&quot;

        pairs &lt;&lt; [
                k: awsEncode(key, false),
                v: awsEncode(value, false)
        ]
    }

    pairs.sort { a, b -&gt;
        int cmp = a.k &lt;=&gt; b.k
        cmp != 0 ? cmp : (a.v &lt;=&gt; b.v)
    }

    return pairs.collect { &quot;${it.k}=${it.v}&quot; }.join(&quot;&amp;&quot;)
}

String normalizeHeaderValue(String s) {
    return s == null ? &quot;&quot; : s.trim().replaceAll(&quot;\\s+&quot;, &quot; &quot;)
}

String accessKey    = vars.get(&quot;aws_access_key&quot;)
String secretKey    = vars.get(&quot;aws_secret_key&quot;)
String region       = vars.get(&quot;aws_region&quot;)
String service      = vars.get(&quot;aws_service&quot;)
String method       = vars.get(&quot;aws_method&quot;) ?: &quot;POST&quot;
String endpoint     = vars.get(&quot;aws_endpoint&quot;)
String payload      = vars.get(&quot;request_body&quot;) ?: &quot;&quot;
String sessionToken = vars.get(&quot;aws_session_token&quot;) ?: &quot;&quot;
String extraHeaders = vars.get(&quot;aws_signed_headers_extra&quot;) ?: &quot;&quot;
String contentType  = vars.get(&quot;content_type&quot;) ?: &quot;&quot;
String soapAction   = vars.get(&quot;soap_action&quot;) ?: &quot;&quot;

if (!accessKey || !secretKey || !region || !service || !endpoint) {
    throw new IllegalArgumentException(
        &quot;Missing one of required vars: aws_access_key, aws_secret_key, aws_region, aws_service, aws_endpoint&quot;
    )
}

ZonedDateTime now = ZonedDateTime.now(ZoneOffset.UTC)
String amzDate   = now.format(DateTimeFormatter.ofPattern(&quot;yyyyMMdd&apos;T&apos;HHmmss&apos;Z&apos;&quot;))
String dateStamp = now.format(DateTimeFormatter.ofPattern(&quot;yyyyMMdd&quot;))

URI uri = new URI(endpoint)
String host = uri.getHost()
int port = uri.getPort()

String hostHeader = host
if (port != -1 &amp;&amp;
    !((uri.getScheme() == &quot;https&quot; &amp;&amp; port == 443) || (uri.getScheme() == &quot;http&quot; &amp;&amp; port == 80))) {
    hostHeader = &quot;${host}:${port}&quot;
}

String canonicalURI = canonicalUri(uri.getRawPath())
String canonicalQS  = canonicalQueryString(uri.getRawQuery())

String payloadHash = sha256Hex(payload)
int byteLength = payload.getBytes(StandardCharsets.UTF_8).length

Map&lt;String, String&gt; headersToSign = new TreeMap&lt;&gt;()

headersToSign[&quot;host&quot;] = hostHeader
headersToSign[&quot;x-amz-date&quot;] = amzDate
headersToSign[&quot;x-amz-content-sha256&quot;] = payloadHash

if (sessionToken) {
    headersToSign[&quot;x-amz-security-token&quot;] = sessionToken
}

if (contentType) {
    headersToSign[&quot;content-type&quot;] = normalizeHeaderValue(contentType)
}

if (soapAction) {
    headersToSign[&quot;soapaction&quot;] = normalizeHeaderValue(soapAction)
}

extraHeaders.split(&quot;\\r?\\n&quot;).each { line -&gt;
    if (line?.trim()) {
        int idx = line.indexOf(&quot;:&quot;)
        if (idx &lt;= 0) {
            throw new IllegalArgumentException(&quot;Invalid aws_signed_headers_extra line: ${line}&quot;)
        }

        String hName = line.substring(0, idx).trim().toLowerCase(Locale.ROOT)
        String hVal  = normalizeHeaderValue(line.substring(idx + 1))
        headersToSign[hName] = hVal
    }
}

String canonicalHeaders = headersToSign.collect { k, v -&gt;
    &quot;${k}:${normalizeHeaderValue(v)}\n&quot;
}.join(&quot;&quot;)

String signedHeaders = headersToSign.keySet().join(&quot;;&quot;)

String canonicalRequest =
        method.toUpperCase(Locale.ROOT) + &quot;\n&quot; +
        canonicalURI + &quot;\n&quot; +
        canonicalQS + &quot;\n&quot; +
        canonicalHeaders + &quot;\n&quot; +
        signedHeaders + &quot;\n&quot; +
        payloadHash

String algorithm = &quot;AWS4-HMAC-SHA256&quot;
String credentialScope = &quot;${dateStamp}/${region}/${service}/aws4_request&quot;

String stringToSign =
        algorithm + &quot;\n&quot; +
        amzDate + &quot;\n&quot; +
        credentialScope + &quot;\n&quot; +
        sha256Hex(canonicalRequest)

byte[] kSecret  = (&quot;AWS4&quot; + secretKey).getBytes(StandardCharsets.UTF_8)
byte[] kDate    = hmacSha256(kSecret, dateStamp)
byte[] kRegion  = hmacSha256(kDate, region)
byte[] kService = hmacSha256(kRegion, service)
byte[] kSigning = hmacSha256(kService, &quot;aws4_request&quot;)

String signature = bytesToHex(hmacSha256(kSigning, stringToSign))

String authorizationHeader =
        &quot;${algorithm} &quot; +
        &quot;Credential=${accessKey}/${credentialScope}, &quot; +
        &quot;SignedHeaders=${signedHeaders}, &quot; +
        &quot;Signature=${signature}&quot;

vars.put(&quot;aws_amz_date&quot;, amzDate)
vars.put(&quot;aws_date_stamp&quot;, dateStamp)
vars.put(&quot;aws_host&quot;, hostHeader)
vars.put(&quot;aws_payload_hash&quot;, payloadHash)
vars.put(&quot;aws_canonical_uri&quot;, canonicalURI)
vars.put(&quot;aws_canonical_querystring&quot;, canonicalQS)
vars.put(&quot;aws_canonical_request&quot;, canonicalRequest)
vars.put(&quot;aws_string_to_sign&quot;, stringToSign)
vars.put(&quot;aws_signature&quot;, signature)
vars.put(&quot;aws_authorization&quot;, authorizationHeader)
vars.put(&quot;request_body_length&quot;, String.valueOf(byteLength))

// Updrate: adding headers through grovy
import org.apache.jmeter.protocol.http.control.Header
import org.apache.jmeter.protocol.http.control.HeaderManager

HeaderManager hm = sampler.getHeaderManager()

if (hm == null) {
    hm = new HeaderManager()
    sampler.setHeaderManager(hm)
}

def setHeader = { name, value -&gt;
    if (value != null) {
        String v = value.toString().trim()
        if (!v.isEmpty()) {
            hm.removeHeaderNamed(name)
            hm.add(new Header(name, v))
        }
    }
}

// remove first, so final order is controlled
[
    &quot;Content-Type&quot;,
    &quot;SOAPAction&quot;,
    &quot;x-amz-content-sha256&quot;,
    &quot;x-amz-date&quot;,
    &quot;Authorization&quot;
].each { hm.removeHeaderNamed(it) }

// TODO: check if capital letters for AWS headers required 
// add in required order
setHeader(&quot;Content-Type&quot;, vars.get(&quot;content_type&quot;))
setHeader(&quot;SOAPAction&quot;, vars.get(&quot;soap_action&quot;))
setHeader(&quot;X-Amz-Content-Sha256&quot;, vars.get(&quot;aws_payload_hash&quot;))
setHeader(&quot;X-Amz-Date&quot;, vars.get(&quot;aws_amz_date&quot;))
setHeader(&quot;Authorization&quot;, vars.get(&quot;aws_authorization&quot;))

log.info(&quot;AWS SigV4 generated for endpoint=${endpoint}&quot;)
log.debug(&quot;aws_amz_date=&quot; + amzDate)
log.debug(&quot;aws_authorization=&quot; + authorizationHeader)</stringProp>
          <stringProp name="TestPlan.comments">Generates canonical signature</stringProp>
        </JSR223PreProcessor>
        <hashTree/>
        <HTTPSamplerProxy guiclass="HttpTestSampleGui" testclass="HTTPSamplerProxy" testname="HTTP Request">
          <stringProp name="TestPlan.comments">Update for system specific</stringProp>
          <stringProp name="HTTPSampler.domain">localhost</stringProp>
          <stringProp name="HTTPSampler.port">3000</stringProp>
          <stringProp name="HTTPSampler.protocol">http</stringProp>
          <stringProp name="HTTPSampler.path">/value</stringProp>
          <boolProp name="HTTPSampler.follow_redirects">true</boolProp>
          <stringProp name="HTTPSampler.method">POST</stringProp>
          <boolProp name="HTTPSampler.use_keepalive">true</boolProp>
          <boolProp name="HTTPSampler.postBodyRaw">true</boolProp>
          <elementProp name="HTTPsampler.Arguments" elementType="Arguments">
            <collectionProp name="Arguments.arguments">
              <elementProp name="" elementType="HTTPArgument">
                <boolProp name="HTTPArgument.always_encode">false</boolProp>
                <stringProp name="Argument.value">${request_body}</stringProp>
                <stringProp name="Argument.metadata">=</stringProp>
              </elementProp>
            </collectionProp>
          </elementProp>
        </HTTPSamplerProxy>
        <hashTree/>
        <ResultCollector guiclass="ViewResultsFullVisualizer" testclass="ResultCollector" testname="View Results Tree">
          <boolProp name="ResultCollector.error_logging">false</boolProp>
        </ResultCollector>
        <hashTree/>
        <ResultCollector guiclass="SummaryReport" testclass="ResultCollector" testname="Summary Report">
          <boolProp name="ResultCollector.error_logging">false</boolProp>
        </ResultCollector>
        <hashTree/>
        <ResultCollector guiclass="GraphVisualizer" testclass="ResultCollector" testname="Graph Results">
          <boolProp name="ResultCollector.error_logging">false</boolProp>
        </ResultCollector>
        <hashTree/>
      </hashTree>
    </hashTree>
  </hashTree>
</jmeterTestPlan>